<a href="https://colab.research.google.com/github/ttsuneoka/GoogleColab/blob/master/Chapter2_4_191116.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
# Series
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [ ]:
# index
sample_pandas_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90],index=['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [ ]:
print("data value:", sample_pandas_index_data.values)
print("index value", sample_pandas_index_data.index)

data value: [ 0 10 20 30 40 50 60 70 80 90]
index value Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [ ]:
# DataFrame
attri_data1 = {
    'ID':['100','101','102','103','104'],
    'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
    'Birth_year':[1990, 1989, 1992, 1997, 1982],
    'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']
}

attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [ ]:
attri_data_frame_index1 = DataFrame(attri_data1, index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [ ]:
# Transpose
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [ ]:
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [ ]:
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [ ]:
# data extraction
attri_data_frame1[attri_data_frame1['City']== 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [ ]:
attri_data_frame1['City']== 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [ ]:
# extraction condition
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

In [ ]:
print(attri_data_frame1)
print(attri_data_frame1.drop(['Birth_year'],axis=1))

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve
    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [ ]:
attri_data2 = {
    'ID':['100','101','102','105','107'],
    'Math':[50,43,33,76,98],
    'English':[90,30,20,50,30],
    'Sex':['M','F','F','M','M']
}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [ ]:
pd.merge(attri_data_frame1,attri_data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

In [ ]:
# calculation
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [ ]:
attri_data_frame2.groupby('Sex')['English'].max()

Sex
F    30
M    90
Name: English, dtype: int64

In [ ]:
attri_data2 = {
    'ID':['100','101','102','103','104'],
    'City':['Tokyo','Osaka','kyoto','Hokkaido','Tokyo'],
    'Birth_year':[1990,1989,1992,1997,1982],
    'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']
}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame_index2 = DataFrame(attri_data2, index=['e','b','a','d','c'])
attri_data_frame_index2

    ID      City  Birth_year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
a  102     kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [ ]:
# Sort by index
attri_data_frame_index2.sort_index()

    ID      City  Birth_year     Name
a  102     kyoto        1992     Yuki
b  101     Osaka        1989    Akiko
c  104     Tokyo        1982    Steve
d  103  Hokkaido        1997   Satoru
e  100     Tokyo        1990  Hiroshi

In [ ]:
# Sort by value
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

In [ ]:
attri_data_frame_index2.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [ ]:
import numpy as np
attri_data_frame_index2['Name'] = np.nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [ ]:
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

In [ ]:
# Practice 2-7
from pandas import Series, DataFrame
import pandas as pd

attri_data1 = {
    'ID':['1','2','3','4','5'],
    'Sex':['F','F','M','M','F'],
    'Money':[1000,2000,500,300,700],
    'Name':['Saito','Horie','Kondo','Kawada','Matsubara']
}
attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)
print(attri_data_frame1[attri_data_frame1['Money'] >= 500])

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
3  4   M    300     Kawada
4  5   F    700  Matsubara
  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matsubara

In [ ]:
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [ ]:
attri_data2 ={
    'ID':['3','4','7'],
    'Math':[60,30,40],
    'English':[80,20,30]
}

attri_data_frame2 = DataFrame(attri_data2)

print(pd.merge(attri_data_frame1,attri_data_frame2))
print("Money:", pd.merge(attri_data_frame1,attri_data_frame2)['Money'].mean())
print("Math:", pd.merge(attri_data_frame1,attri_data_frame2)['Math'].mean())
print("English:", pd.merge(attri_data_frame1,attri_data_frame2)['English'].mean())

  ID Sex  Money    Name  Math  English
0  3   M    500   Kondo    60       80
1  4   M    300  Kawada    30       20
Money: 400.0
Math: 45.0
English: 50.0